In [5]:
import pandas as pd
import numpy as np
from pydataset import data
import env

In [6]:
df = pd.read_sql('SELECT * FROM salaries',env.get_db_url("employees"))

In [7]:
df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [8]:
df.emp_no.max()

499999

In [9]:
df.to_date.max()

datetime.date(9999, 1, 1)

In [10]:
df.emp_no.idxmax()

2844042

In [17]:
df.to_date.idxmax()

#PRODUCES TYPERROR
#TypeError: reduction operation 'argmax' not allowed for this dtype

TypeError: reduction operation 'argmax' not allowed for this dtype

##### Looking at types

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844047 entries, 0 to 2844046
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   emp_no     int64
 1   salary     int64
 2   from_date  object
 3   to_date    object
dtypes: int64(2), object(2)
memory usage: 86.8+ MB

In [13]:
type(df.to_date)

pandas.core.series.Series

In [18]:
type(df.to_date[1])

datetime.date

In [20]:
for i in df.to_date:
    if isinstance(i,'datetime.date'): print(type(i))

TypeError: isinstance() arg 2 must be a type or tuple of types

In [14]:
df.select_dtypes(include=object)

          from_date     to_date
0        1986-06-26  1987-06-26
1        1987-06-26  1988-06-25
2        1988-06-25  1989-06-25
3        1989-06-25  1990-06-25
4        1990-06-25  1991-06-25
...             ...         ...
2844042  1997-11-30  1998-11-30
2844043  1998-11-30  1999-11-30
2844044  1999-11-30  2000-11-29
2844045  2000-11-29  2001-11-29
2844046  2001-11-29  9999-01-01

[2844047 rows x 2 columns]

In [15]:
df.select_dtypes(include=['datetime','datetimetz','number'])

         emp_no  salary
0         10001   60117
1         10001   62102
2         10001   66074
3         10001   66596
4         10001   66961
...         ...     ...
2844042  499999   63707
2844043  499999   67043
2844044  499999   70745
2844045  499999   74327
2844046  499999   77303

[2844047 rows x 2 columns]

#### Recap:
- Pandas calls it a series, but max() works on it and idxmax() does not

So now I want to get it into something I can work with easier

In [22]:
df.to_date.str.startswith('F')

AttributeError: Can only use .str accessor with string values!

In [ ]:
df.to_date.str.startswith('19')

##### Doesn't recognize it as string

In [24]:
pd.to_datetime(df.to_date,errors='coerce')

0         1987-06-26
1         1988-06-25
2         1989-06-25
3         1990-06-25
4         1991-06-25
             ...
2844042   1998-11-30
2844043   1999-11-30
2844044   2000-11-29
2844045   2001-11-29
2844046          NaT
Name: to_date, Length: 2844047, dtype: datetime64[ns]

# Look into NaT

### My Questions
- Does pd.to_datetime have a method of identifying